'''
Задача 28: Напишите рекурсивную функцию sum(a, b), возвращающую сумму двух целых неотрицательных чисел. Из всех арифметических 
операций допускаются только +1 и -1. Также нельзя использовать циклы.
'''

def sum(a, b):
    res = a + b
    if a == 0:
        return res
    else:
        return sum(a - 1, b + 1)

d = sum(3, 7) 
print(d)