'''
Задача 34: Винни-Пух попросил Вас посмотреть, есть ли в его стихах ритм. Поскольку
разобраться в его кричалках не настолько просто, насколько легко он их придумывает, Вам
стоит написать программу. Винни-Пух считает, что ритм есть, если число слогов (т.е. число
гласных букв) в каждой фразе стихотворения одинаковое. Фраза может состоять из одного
слова, если во фразе несколько слов, то они разделяются дефисами. Фразы отделяются друг
от друга пробелами. Стихотворение Винни-Пух вбивает в программу с клавиатуры. В ответе
напишите “Парам пам-пам”, если с ритмом все в порядке и “Пам парам”, если с ритмом все не
в порядке
Ввод: пара-ра-рам рам-пам-папам па-ра-па-дам
Вывод:Парам пам-пам
'''

list_1 = (input("Введите стихотворение: ")).split()
print(list_1)


def count_vowels(list_1):
    list_vowels = set("аеёийоуыэюя")
    list_2 = [sum(1 for letter in word if letter in list_vowels) for word in list_1]
    return(list_2)
     
     
list_2 = count_vowels(list_1)

a = "Парам пам-пам"
b = "Пам парам"
print(a if len(set(list_2)) == 1 else b)



