'''
Задача 10: На столе лежат n монеток. Некоторые из них лежат вверх решкой, а некоторые – гербом. Определите минимальное число
монеток, которые нужно перевернуть, чтобы все монетки были повернуты вверх одной и той же стороной. Выведите минимальное
количество монет, которые нужно перевернуть.
5 -> 1 0 1 1 0
2
'''
import random


coin = int(input("Введите количество монеток "))
i = 0
res = []
while i < coin:
    k = random.randint(0, 1) 
    i +=1
    res.append(k)
print(res)

j = 0
k = 0
i = 0
while i < len(res):
    if res[i] == 1:
        j += 1
        i += 1
    else:
        k += 1
        i += 1
if k < j:
        print(f"Нужно перевернуть {k} монетки")
else:
        print(f"Нужно перевернуть {j} монетки")

       