'''
Задача 24: В фермерском хозяйстве в Карелии выращивают чернику. Она растет на круглой грядке, причем кусты высажены только по окружности. 
Таким образом, у каждого куста есть ровно два соседних. Всего на грядке растет N кустов. Эти кусты обладают разной урожайностью, 
поэтому ко времени сбора на них выросло различное число ягод – на i-ом кусте выросло ai ягод. В этом фермерском хозяйстве внедрена система 
автоматического сбора черники. Эта система состоит из управляющего модуля и нескольких собирающих модулей. Собирающий модуль за один заход, 
находясь непосредственно перед некоторым кустом, собирает ягоды с этого куста и с двух соседних с ним. Напишите программу для нахождения 
максимального числа ягод, которое может собрать за один заход собирающий модуль, находясь перед некоторым кустом заданной во входном 
файле грядки.
4 -> 1 2 3 4
9
'''

bushes = int(input("Введите количество курстов на круглой грядке (не менее 3): "))

berries = []
for i in range(bushes):
    berries.extend([int(input("Введите количество ягод на кусте: "))])

print(*berries)

berries2 = berries[1:] + berries[:1] # сдвинули кусты


harvest_max = 0
j = 0
for i in range(bushes):
    harvest = berries[j] + berries[j-1] + berries[j-2]
    berries2 = berries[j:] + berries[:j]
    j+=1
    if harvest_max < harvest:
        harvest_max = harvest
    
print(f"Максимальное количество ягод: {harvest_max}")




