'''
Задача 32: Определить индексы элементов массива (списка),значения которых принадлежат заданному диапазону (т.е. не
меньше заданного минимума и не больше заданного максимума)
Ввод: [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]
Вывод: [1, 9, 13, 14, 19]
'''


m = int(input("Введите начальный дипазон "))
n = int(input("Введите конечный дипазон "))

def index_definition(start: int, stop: int):
    list_1 = [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]
    list_2 =[]
    i = 0
    while i < len(list_1):
        if list_1[i] >= m and list_1[i] <= n:
            list_2.append(i)
        i+=1
    print(list_2)

index_definition(m, n)
